package chapter08.ex04;



public class Lombok {
	
	
	public static void main(String[] args) {
		
		// Lombok : 설치가 필요함.
		// https://projectlombok.org/download 에서 다운
		// 파일을 간단한 주소로 바꾸어 놓고 
		// 공유폴더에 jdk 17다운
		// cmd 관리자 실행 
		// cd\ 입력, cd 파일경로 이동...
		// java -jar lombok.jar입력
		// 설치다하고 설치경로(사용자에 이클립스 가면)에 가면 lombok.jar 있는지 확인 
		// eclipse.ini 파일을 메모장으로 드래그해서 열면 마지막에 등록되어잇음.
		// eclipse 재시작
		// 프로젝트 오른쪽 클릭 ---> 자바 빌드패스 ---> 라이브러리(클래스의 묶음(jar)) ---> add extra... ---> 롬북파일 추가 
		// @ + ctrl + spacebar 하면 작동됨.(클래스 아래에 있는 필드들을 작동시킴) 클래스 위에 작성함.
		// window --> show view --> outline으로 확인가능
		
		
		
		
		
		// 라이브러리 : 클래스(기능)들의 묶음.... ---> .jar 확장자로 되어있음 ===> 누군가가 만들어 놓은 기능을 내가 가져다가 쓰는것.
		//																주체 : 내가 주도적으로 사용
		
		// 프레임워크 : Spring, Spring Boot ===> 누군가가 만들어 놓은 개발 틀을 내가 따라서 만들어 나가는 것.
		//										큰 뼈대를 만들어 놓은것을... 만들어 놓은 틀(뼈대)에 의해서 내용물(기능들)을 붙이는 것.
		//																주체 : 프레임워크(틀)
		//										코드가 간결해지고 보안이 좋음. 유지보수가 쉬움.
		//		개발차 초기==> 기능위주, 유지/보수는 생각을 못함.			개발자 연차가 높아질수록 유지/보수를 쉽게 하는 코드를 짜냄.
		
		
		
		
		
		
		
		
		
	}

}
